Repository: Alhadi706/coupona_merchant_app
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, tr

# noOffersForCustomer
source: No offers for this customer
ar: لا يوجد عروض لهذا الزبون
de: Keine Angebote für diesen Kunden
es: Sin ofertas para este cliente
fr: Aucune offre pour ce client
it: Nessuna offerta per questo cliente
tr: Bu müşteri için teklif yok

# orderNumber
source: Order #: {id}
ar: طلب رقم: {id}
de: Bestellung #: {id}
es: Pedido #: {id}
fr: Commande #: {id}
it: Ordine #: {id}
tr: Sipariş #: {id}

# invoiceNumber
source: Invoice #: {id}
ar: فاتورة رقم: {id}
de: Rechnung #: {id}
es: Factura #: {id}
fr: Facture #: {id}
it: Fattura #: {id}
tr: Fatura #: {id}

# dateLabel
source: Date: {date}
ar: التاريخ: {date}
de: Datum: {date}
es: Fecha: {date}
it: Data: {date}
tr: Tarih: {date}

# amountLabel
source: Amount: {amount}
ar: المبلغ: {amount}
de: Betrag: {amount}
es: Monto: {amount}
fr: Montant: {amount}
it: Importo: {amount}
tr: Tutar: {amount}

source: Support offer
ar: دعم العرض
de: Angebot unterstützen
es: Apoyar oferta
fr: Soutenir offre
it: Supporta offerta
tr: Teklifi destekle

source: Offer supported
ar: تم دعم العرض
de: Angebot unterstützt
es: Oferta apoyada
fr: Offre soutenue
it: Offerta supportata
tr: Teklif desteklendi

# customerReportsTitle
source: Customer Reports
ar: بلاغات الزبائن
de: Kundenberichte
es: Reportes clientes
fr: Rapports Clients
it: Segnalazioni clienti
tr: Müşteri Raporları

source: Unknown date
ar: تاريخ غير معروف
de: Unbekanntes Datum
es: Fecha desconocida
fr: Date inconnue
it: Data sconosciuta
tr: Bilinmeyen tarih

# reportDate
source: Report date: {date}
ar: تاريخ البلاغ: {date}
de: Berichtsdatum: {date}
es: Fecha reporte: {date}
fr: Date rapport: {date}
it: Data segnalazione: {date}
tr: Rapor tarihi: {date}

source: No message
ar: لا يوجد نص
de: Keine Nachricht
es: Sin mensaje
fr: Pas de message
it: Nessun messaggio
tr: Mesaj yok

# receiptsLogTitle
source: Receipts Log
ar: سجل الفواتير
de: Belegverlauf
es: Historial recibos
fr: Journal des reçus
it: Storico ricevute
tr: Fiş geçmişi

# statusPending
source: Pending
ar: قيد المراجعة
de: Prüfung
es: Pendiente
fr: En attente
it: In revisione
tr: İncelemede

# statusAccepted
source: Accepted
ar: مقبولة
de: Akzeptiert
es: Aceptada
fr: Acceptée
it: Accettata
tr: Kabul

# statusRejected
source: Rejected
ar: مرفوضة
de: Abgelehnt
es: Rechazada
fr: Rejetée
it: Rifiutata
tr: Reddedildi

# statusLabel
source: Status: {value}
ar: الحالة: {value}
es: Estado: {value}
fr: Statut: {value}
it: Stato: {value}
tr: Durum: {value}

# invoiceNumberShort
source: Receipt #: {num}
ar: فاتورة رقم: {num}
de: Beleg #: {num}
es: Recibo #: {num}
fr: Reçu #: {num}
it: Ricevuta #: {num}
tr: Fiş #: {num}

# createdAtLabel
source: Created: {date}
ar: التاريخ: {date}
de: Erstellt: {date}
es: Creado: {date}
fr: Créé: {date}
it: Creato: {date}
tr: Oluşturuldu: {date}

# quantityPrice
source: Qty: {qty} | Price: {price}
ar: الكمية: {qty} | السعر: {price}
de: Menge: {qty} | Preis: {price}
es: Cant: {qty} | Precio: {price}
fr: Qté: {qty} | Prix: {price}
it: Qtà: {qty} | Prezzo: {price}
tr: Adet: {qty} | Fiyat: {price}

source: No product details
ar: لا توجد تفاصيل منتجات
de: Keine Produktdetails
es: Sin detalles de producto
fr: Pas de détails produits
it: Nessun dettaglio prodotto
tr: Ürün detayı yok

source: No active rewards
ar: لا توجد جوائز مفعلة
de: Keine aktiven Prämien
es: Sin recompensas activas
fr: Aucune récompense active
it: Nessun premio attivo
tr: Aktif ödül yok

source: No redeemed rewards
ar: لا توجد جوائز تم استبدالها
de: Keine eingelösten Prämien
es: Sin recompensas canjeadas
fr: Aucune récompense utilisée
it: Nessun premio riscattato
tr: Kullanılan ödül yok

# manageRewardsTitle
source: Manage Rewards
ar: إدارة الجوائز
de: Prämien verwalten
es: Gestionar recompensas
fr: Gérer Récompenses
it: Gestisci premi
tr: Ödülleri Yönet

# activeRewardsTab
source: Active Rewards
ar: الجوائز المفعلة
de: Aktiv
es: Activas
fr: Actives
it: Attivi
tr: Aktif

# redeemedRewardsTab
source: Redeemed History
ar: سجل الاستبدال
de: Historie
es: Historial
fr: Historique
it: Storico
tr: Geçmiş

source: Add new reward
ar: إضافة جائزة جديدة
de: Neue Prämie
es: Nueva recompensa
fr: Ajouter récompense
it: Nuovo premio
tr: Yeni ödül

# syncRewards
source: Sync Firestore rewards
ar: مزامنة جوائز Firestore
de: Prämien synchronisieren
es: Sincronizar recompensas
fr: Synchroniser récompenses
it: Sincronizza premi
tr: Ödülleri senkronize et

# scanQrReward
source: Scan QR to redeem
ar: مسح QR لاسترداد
de: QR scannen
es: Escanear QR
fr: Scanner QR
it: Scansiona QR
tr: QR tara

# syncingDone
source: Synced
ar: تمت المزامنة
de: Synchronisiert
es: Sincronizado
fr: Synchronisé
it: Sincronizzato
tr: Senkronize edildi

source: Sync failed
ar: فشل المزامنة
de: Sync fehlgeschlagen
es: Fallo sync
fr: Échec sync
it: Sync fallito
tr: Sync başarısız

# loginFirstSupabase
source: Login first (Supabase session missing)
ar: سجّل الدخول أولاً (جلسة Supabase غير موجودة)
de: Erst einloggen (Supabase Sitzung fehlt)
es: Inicie sesión (sin sesión Supabase)
fr: Connectez-vous (session Supabase manquante)
it: Fai login (sessione Supabase assente)
tr: Önce giriş yap (Supabase yok)

# deleteRewardError
source: Failed to delete reward
ar: فشل حذف الجائزة
de: Prämie löschen fehlgeschlagen
es: Eliminar recompensa falló
fr: Échec suppression récompense
it: Eliminazione premio fallita
tr: Ödül silme başarısız

# rewardNoTitle
source: Untitled reward
ar: جائزة بدون عنوان
de: Ohne Titel
es: Sin título
fr: Sans titre
it: Senza titolo
tr: Başlıksız ödül

# qrRewardTitle
source: QR to redeem reward
ar: QR لاستلام الجائزة
de: QR zum Einlösen
es: QR recompensa
fr: QR pour récompense
it: QR premio
tr: Ödül QR

# closeLower
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
tr: Kapat

# unknownDateShort
source: Unknown date
ar: تاريخ غير معروف
de: Unbekanntes Datum
es: Fecha desconocida
fr: Date inconnue
it: Data sconosciuta
tr: Bilinmeyen tarih

# rewardTitleLabel
source: Reward: {title}
ar: جائزة: {title}
de: Prämie: {title}
es: Recompensa: {title}
fr: Récompense: {title}
it: Premio: {title}
tr: Ödül: {title}

# customerLabel
source: Customer: {name}
ar: زبون: {name}
de: Kunde: {name}
es: Cliente: {name}
fr: Client: {name}
it: Cliente: {name}
tr: Müşteri: {name}

# registerNewMerchantTitle
source: New Merchant Registration
ar: تسجيل تاجر جديد
de: Neue Händlerregistrierung
es: Registro nuevo comerciante
fr: Inscription nouveau commerçant
it: Registrazione nuovo commerciante
tr: Yeni Mağaza Kaydı

# activityOtherPrompt
source: Specify other activity
ar: حدد نشاط آخر
de: Andere Tätigkeit angeben
es: Especificar otra actividad
fr: Préciser autre activité
it: Specifica altra attività
tr: Diğer faaliyeti belirt

# pickStoreOnMap
source: Pick store location on map
ar: حدد موقع المحل على الخريطة
de: Standort auf Karte wählen
es: Elegir ubicación en el mapa
fr: Choisir l'emplacement sur la carte
it: Seleziona posizione su mappa
tr: Haritada konumu seç

# storeLocationPicked
source: Location selected
ar: تم اختيار الموقع
de: Standort ausgewählt
es: Ubicación seleccionada
fr: Emplacement sélectionné
it: Posizione selezionata
tr: Konum seçildi

# autoLocating
source: Locating...
ar: جارٍ تحديد الموقع...
de: Lokalisierung...
es: Localizando...
fr: Localisation...
it: Localizzazione...
tr: Konum alınıyor...

# autoLocateButton
source: Auto locate
ar: تحديد الموقع تلقائياً
de: Auto lokalisieren
es: Auto localizar
fr: Localiser auto
it: Localizza auto
tr: Oto konum

# submitRegister
source: Register
ar: تسجيل
de: Registrieren
es: Registrar
fr: S'inscrire
it: Registrati
tr: Kayıt ol

source: Location service disabled
ar: خدمة الموقع معطلة
de: Standortdienst deaktiviert
es: Servicio de ubicación desactivado
fr: Service de localisation désactivé
it: Servizio localizzazione disattivato
tr: Konum servisi kapalı

source: Location permission denied
ar: تم رفض إذن الموقع
de: Standortberechtigung verweigert
es: Permiso de ubicación denegado
fr: Autorisation localisation refusée
it: Permesso localizzazione negato
tr: Konum izni reddedildi

# locationPermissionDeniedForever
source: Location permission permanently denied. Open settings.
ar: تم رفض إذن الموقع نهائياً. افتح الإعدادات.
de: Standortberechtigung dauerhaft verweigert. Einstellungen öffnen.
es: Permiso de ubicación denegado permanentemente. Abrir ajustes.
fr: Autorisation localisation définit. refusée. Ouvrir paramètres.
it: Permesso localizzazione negato permanentemente. Apri impostazioni.
tr: Konum izni kalıcı reddedildi. Ayarları açın.

# locationAutoCaptured
source: Location captured automatically
ar: تم التقاط الموقع تلقائياً
de: Standort automatisch erfasst
es: Ubicación capturada automáticamente
fr: Localisation capturée auto
it: Posizione catturata automaticamente
tr: Konum otomatik alındı

# locationFailed
source: Failed to get location: {error}
ar: فشل جلب الموقع: {error}
de: Standort fehlgeschlagen: {error}
es: Fallo ubicación: {error}
fr: Échec localisation: {error}
it: Localizzazione fallita: {error}
tr: Konum alınamadı: {error}

# completeProfileTitle
source: Complete Profile
ar: إكمال الملف الشخصي
de: Profil vervollständigen
es: Completar perfil
fr: Compléter le profil
it: Completa Profilo
tr: Profili Tamamla

# mustLoginFirst
source: You must login first
ar: يجب تسجيل الدخول أولاً
de: Sie müssen sich zuerst anmelden
es: Debe iniciar sesión primero
fr: Vous devez d'abord vous connecter
it: Devi prima accedere
tr: Önce giriş yapmalısın

# profileSavedSuccess
source: Profile saved successfully!
ar: تم حفظ الملف بنجاح!
de: Profil erfolgreich gespeichert!
es: Perfil guardado con éxito!
fr: Profil enregistré avec succès!
it: Profilo salvato con successo!
tr: Profil başarıyla kaydedildi!

# genericErrorWithMessage
source: Error: {message}
ar: خطأ: {message}
de: Fehler: {message}
fr: Erreur: {message}
it: Errore: {message}
tr: Hata: {message}

# requiredField
source: Field is required
ar: الحقل مطلوب
de: Pflichtfeld
es: Campo obligatorio
fr: Champ requis
it: Campo obbligatorio
tr: Zorunlu alan

source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
tr: Kaydet

# pointsSystemTitle
source: Points System
ar: نظام النقاط
de: Punktesystem
es: Sistema de puntos
fr: Système de points
it: Sistema punti
tr: Puan Sistemi

# pointsMechanismTitle
source: Calculation Mechanism
ar: آلية الحساب
de: Berechnungsmechanismus
es: Mecanismo de cálculo
fr: Mécanisme de calcul
it: Meccanismo di calcolo
tr: Hesaplama Mekanizması

# pointsSimplifiedDescription
source: The system is simplified: total points = sum(product assigned points × quantity in receipt). No extra settings for now.
ar: النظام مبسّط: إجمالي النقاط = مجموع (النقاط المحددة للمنتج × الكمية في الفاتورة). لا إعدادات إضافية حالياً.
de: Vereinfachtes System: Gesamtpunkte = Summe(Produktpunkte × Menge im Beleg). Keine weiteren Einstellungen derzeit.
es: Sistema simplificado: puntos totales = suma(puntos del producto × cantidad en el recibo). Sin más ajustes por ahora.
fr: Système simplifié: total des points = somme(points produit × quantité du reçu). Pas d'autres réglages pour l'instant.
it: Sistema semplificato: punti totali = somma(punti assegnati × quantità nel ricevuta). Nessuna altra impostazione ora.
tr: Basitleştirilmiş sistem: toplam puan = toplam(ürün puanı × fişteki miktar). Şimdilik ek ayar yok.

# pointsSimplificationBenefitsTitle
source: Simplification Benefits:
ar: مزايا التبسيط:
de: Vorteile der Vereinfachung:
es: Beneficios de simplificación:
fr: Avantages simplification:
it: Vantaggi semplificazione:
tr: Basitleştirmenin Faydaları:

# pointsSimplificationBenefitsBullet
source: • Faster performance & easier to understand • Avoid special-case complexity • Change per-product points instantly without retroactive effect unless manually applied
ar: • أداء أسرع وأسهل للفهم • تجنب التعقيد للحالات الخاصة • تغيير نقاط المنتج يُطبق فوراً بدون أثر رجعي إلا إذا طُبق يدوياً
de: • Schnellere Performance & leichter verständlich • Vermeidet Sonderfall-Komplexität • Änderung von Produktpunkten wirkt sofort ohne rückwirkenden Effekt außer manuell
es: • Rendimiento rápido y fácil de entender • Evita complejidad de casos especiales • Cambiar puntos de producto es instantáneo sin efecto retroactivo salvo manual
fr: • Performance et compréhension rapides • Évite complexité des cas particuliers • Changer les points produit est instantané sans effet rétroactif sauf application manuelle
it: • Performance più veloce e facile da capire • Evita complessità casi speciali • Cambio punti prodotto immediato senza effetto retroattivo salvo manuale
tr: • Daha hızlı performans & anlaşılır • Özel durum karmaşıklığını önler • Ürün puanı değişimi anında etkili geriye dönük etki yok (manuel hariç)

# addOfferTitle
source: Add New Offer
ar: إضافة عرض جديد
de: Neues Angebot
es: Añadir oferta
fr: Ajouter une offre
it: Nuova offerta
tr: Yeni teklif

# offerImagePlaceholderOptional
source: Offer image (optional)
ar: صورة العرض (اختيارية)
de: Angebotsbild (optional)
es: Imagen de la oferta (opcional)
fr: Image de l'offre (optionnel)
it: Immagine offerta (opzionale)
tr: Teklif resmi (opsiyonel)

# pickFromGallery
source: From Gallery
ar: من الاستوديو
de: Aus Galerie
es: Desde galería
fr: Depuis galerie
it: Dalla galleria
tr: Galeriden

source: Capture with Camera
ar: التقاط بالكاميرا
de: Foto aufnehmen
es: Tomar foto
fr: Prendre photo
it: Scatta foto
tr: Kamera ile

# imageOptionalNote
source: Image can be left empty or you can pick/capture a new one.
ar: يمكن ترك الصورة فارغة، أو اختيار/التقاط صورة جديدة.
de: Bild kann leer bleiben oder neu gewählt/aufgenommen werden.
es: La imagen puede dejarse vacía o elegir/tomar nueva.
fr: L'image peut être vide ou choisie/capturée.
it: L'immagine può restare vuota oppure sceglierne/scattarne una.
tr: Resim boş bırakılabilir veya yeni seçilebilir/çekilebilir.

# offerTitleLabel
source: Offer Title
ar: عنوان العرض
de: Angebotstitel
es: Título de la oferta
fr: Titre de l'offre
it: Titolo offerta
tr: Teklif başlığı

# offerDescriptionLabel
source: Offer Description
ar: وصف العرض
de: Angebotsbeschreibung
es: Descripción de la oferta
fr: Description de l'offre
it: Descrizione offerta
tr: Teklif açıklaması

# originalPriceLabel
source: Original Price
ar: السعر الأصلي
de: Originalpreis
es: Precio original
fr: Prix original
it: Prezzo originale
tr: Orijinal fiyat

# discountPercentageLabel
source: Discount (%)
ar: نسبة الخصم (%)
de: Rabatt (%)
es: Descuento (%)
fr: Réduction (%)
it: Sconto (%)
tr: İndirim (%)

# discountPercentageInvalid
source: Enter percentage 1-99
ar: ادخل نسبة بين 1-99
de: Prozentsatz 1-99 eingeben
es: Ingrese porcentaje 1-99
fr: Entrez pourcentage 1-99
it: Inserisci percentuale 1-99
tr: 1-99 arası girin

# startDateLabel
source: Start Date
ar: تاريخ البدء
de: Startdatum
es: Fecha inicio
fr: Date début
it: Data inizio
tr: Başlangıç tarihi

# endDateLabel
source: End Date
ar: تاريخ الانتهاء
de: Enddatum
es: Fecha fin
fr: Date fin
it: Data fine
tr: Bitiş tarihi

# chooseGeneric
source: Choose
ar: اختيار
de: Wählen
es: Elegir
fr: Choisir
it: Scegli
tr: Seç

# pickOfferLocation
source: Pick offer location on map
ar: حدد موقع العرض على الخريطة
de: Angebotsstandort auf Karte wählen
es: Elegir ubicación en el mapa
fr: Choisir emplacement sur la carte
it: Seleziona posizione su mappa
tr: Haritada teklif konumu seç

# offerLocationPicked
source: Location selected
ar: تم اختيار الموقع
de: Standort gewählt
es: Ubicación seleccionada
fr: Emplacement sélectionné
it: Posizione selezionata
tr: Konum seçildi

# offerTypeLabel
source: Offer Type
ar: نوع العرض
de: Angebotstyp
es: Tipo de oferta
fr: Type d'offre
it: Tipo offerta
tr: Teklif türü

# offerTypeDiscount
source: Direct Discount
ar: خصم مباشر
de: Direkter Rabatt
es: Descuento directo
fr: Réduction directe
it: Sconto diretto
tr: Doğrudan indirim

# offerTypeGift
source: Gift with Purchase
ar: هدية مع الشراء
de: Geschenk beim Kauf
es: Regalo con compra
fr: Cadeau à l'achat
it: Regalo con acquisto
tr: Alışverişe hediye

# offerTypeCoupon
source: Coupon
ar: كوبون
es: Cupón
tr: Kupon

# offerTypeLimitedTime
source: Limited Time Offer
ar: عرض لفترة محدودة
de: Zeitlich begrenztes Angebot
es: Oferta limitada
fr: Offre limitée
it: Offerta a tempo
tr: Süreli teklif

# offerTypeOther
source: Other...
ar: آخر...
de: Andere...
es: Otro...
fr: Autre...
it: Altro...
tr: Diğer...

# selectStartEndDates
source: Please select start and end dates
ar: الرجاء تحديد تاريخ البدء والانتهاء
de: Bitte Start- und Enddatum wählen
es: Seleccione fechas inicio y fin
fr: Veuillez sélectionner dates début et fin
it: Seleziona date inizio e fine
tr: Lütfen başlangıç ve bitiş tarihlerini seçin

# offerLocationRequired
source: Please pick offer location on map
ar: يرجى اختيار موقع العرض على الخريطة
de: Bitte Angebotsstandort wählen
es: Seleccione ubicación de la oferta
fr: Veuillez choisir l'emplacement de l'offre
it: Seleziona posizione offerta
tr: Lütfen teklif konumunu seçin

# offerTypeRequired
source: Please select offer type
ar: يرجى اختيار نوع العرض
de: Bitte Angebotstyp wählen
es: Seleccione tipo de oferta
fr: Veuillez choisir le type d'offre
it: Seleziona tipo offerta
tr: Lütfen teklif türünü seçin

source: Offer added & synced
ar: تم إضافة العرض ومزامنته
de: Angebot hinzugefügt & synchronisiert
es: Oferta añadida y sincronizada
fr: Offre ajoutée & synchronisée
it: Offerta aggiunta e sincronizzata
tr: Teklif eklendi & senkron

source: Offer updated & synced
ar: تم تحديث العرض ومزامنته
de: Angebot aktualisiert & synchronisiert
es: Oferta actualizada y sincronizada
fr: Offre mise à jour & synchronisée
it: Offerta aggiornata e sincronizzata
tr: Teklif güncellendi & senkron

# imagePickFailed
source: Failed to pick image: {error}
ar: تعذر التقاط/اختيار الصورة: {error}
de: Bildauswahl fehlgeschlagen: {error}
es: Error al seleccionar imagen: {error}
fr: Échec sélection image: {error}
it: Immagine non selezionata: {error}
tr: Resim seçilemedi: {error}

# savedWithSupabaseWarning
source: Saved (Supabase sync warning: {error})
ar: تم الحفظ (تحذير مزامنة Supabase: {error})
de: Gespeichert (Supabase Sync Warnung: {error})
es: Guardado (advertencia sync Supabase: {error})
fr: Enregistré (avert. sync Supabase: {error})
it: Salvato (avviso sync Supabase: {error})
tr: Kaydedildi (Supabase uyarısı: {error})

# offerEndsAt
source: Ends at: {date}
ar: ينتهي في: {date}
de: Endet am: {date}
es: Termina: {date}
fr: Se termine le: {date}
it: Termina il: {date}
tr: Biter: {date}

source: Active
ar: مفعل
de: Aktiv
es: Activo
fr: Actif
it: Attivo
tr: Aktif

source: Store name not available
ar: اسم المحل غير متوفر
de: Geschäftsname nicht verfügbar
es: Nombre de tienda no disponible
fr: Nom du magasin non disponible
it: Nome negozio non disponibile
tr: Mağaza adı mevcut değil

source: Cashier Screen
ar: شاشة الكاشير
de: Kassierer-Bildschirm
es: Pantalla de cajero
fr: Écran caisse
it: Schermo cassa
tr: Kasiyer ekranı

# reportsAndAnalytics
source: Reports & Analytics
ar: التقارير والتحليلات
de: Berichte & Analysen
es: Informes y análisis
fr: Rapports & Analyses
it: Report e analisi
tr: Raporlar ve analiz

source: Community
ar: المجتمع
es: Comunidad
fr: Communauté
it: Comunità
tr: Topluluk

# activityCafe
source: Cafe
ar: مقهى
de: Café
es: Cafetería
fr: Café
it: Caffetteria
tr: Kafe

# activityRestaurant
source: Restaurant
ar: مطعم
es: Restaurante
it: Ristorante
tr: Restoran

# activityClothingStore
source: Clothing Store
ar: متجر ملابس
de: Bekleidungsgeschäft
es: Tienda de ropa
fr: Magasin de vêtements
it: Negozio di abbigliamento
tr: Giyim mağazası

# activityPharmacy
source: Pharmacy
ar: صيدلية
de: Apotheke
es: Farmacia
fr: Pharmacie
it: Farmacia
tr: Eczane

# activitySupermarket
source: Supermarket
ar: سوبرماركت
de: Supermarkt
es: Supermercado
fr: Supermarché
it: Supermercato
tr: Süpermarket

# activityOther
source: Other
ar: آخر
de: Andere
es: Otro
fr: Autre
it: Altro
tr: Diğer
