Repository: Alhadi706/coupona_merchant_app
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, tr

# appTitle
source: Merchant App
ar: تطبيق التاجر
de: Händler App
es: App Comerciante
fr: Application Marchand
it: App Commerciante
tr: Tüccar Uygulaması

source: Login
ar: تسجيل الدخول
de: Anmelden
es: Iniciar sesión
fr: Connexion
it: Accesso
tr: Giriş

source: Logout
ar: تسجيل خروج
de: Abmelden
es: Cerrar sesión
fr: Déconnexion
it: Disconnetti
tr: Çıkış

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
tr: Ayarlar

source: Language
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
it: Lingua
tr: Dil

# noMerchantCode
source: No code
ar: لا يوجد رمز
de: Kein Code
es: Sin código
fr: Pas de code
it: Nessun codice
tr: Kod yok

source: Copied
ar: تم النسخ
de: Kopiert
es: Copiado
fr: Copié
it: Copiato
tr: Kopyalandı

source: Merchant Code
ar: رمز التاجر
de: Händlercode
es: Código de Comerciante
fr: Code Marchand
it: Codice Commerciante
tr: Tüccar Kodu

source: Home
ar: الرئيسية
de: Startseite
es: Inicio
fr: Accueil
tr: Ana Sayfa

source: Offers
ar: العروض
de: Angebote
es: Ofertas
fr: Offres
it: Offerte
tr: Teklifler

source: Customers
ar: الزبائن
de: Kunden
es: Clientes
fr: Clients
it: Clienti
tr: Müşteriler

source: Products
ar: المنتجات
de: Produkte
es: Productos
fr: Produits
it: Prodotti
tr: Ürünler

source: Receipts
ar: الإيصالات
de: Belege
es: Recibos
fr: Reçus
it: Ricevute
tr: Fişler

# copiedMerchantCode
source: Merchant code copied
ar: تم نسخ رمز التاجر
de: Händlercode kopiert
es: Código de comerciante copiado
fr: Code marchand copié
it: Codice commerciante copiato
tr: Tüccar kodu kopyalandı

source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
tr: Kapat

# merchantLoginTitle
source: Merchant Login
ar: دخول التاجر
de: Händler Login
es: Acceso Comerciante
fr: Connexion Marchand
it: Accesso Commerciante
tr: Tüccar Girişi

# enterEmailPassword
source: Please enter email and password
ar: يرجى إدخال البريد الإلكتروني وكلمة المرور
de: Bitte E-Mail und Passwort eingeben
es: Ingrese correo y contraseña
fr: Veuillez entrer email et mot de passe
it: Inserisci email e password
tr: Lütfen e-posta ve şifre girin

source: Login failed
ar: فشل تسجيل الدخول
de: Login fehlgeschlagen
es: Inicio fallido
fr: Échec de connexion
it: Accesso fallito
tr: Giriş başarısız

# loginButton
source: Login
ar: دخول
es: Entrar
fr: Connexion
it: Accesso
tr: Giriş

# createMerchantAccount
source: Create new merchant account
ar: إنشاء حساب تاجر جديد
de: Neues Händlerkonto
es: Crear nueva cuenta
fr: Créer un compte marchand
it: Crea nuovo account
tr: Yeni hesap oluştur

source: Forgot password?
ar: نسيت كلمة المرور؟
de: Passwort vergessen?
es: ¿Olvidó la contraseña?
fr: Mot de passe oublié ?
it: Password dimenticata?
tr: Şifreyi mi unuttun?

# sendResetLink
source: Reset link will be sent
ar: سيتم إرسال رابط استرجاع كلمة المرور
de: Link zum Zurücksetzen wird gesendet
es: Se enviará enlace de reinicio
fr: Lien de réinitialisation sera envoyé
it: Link reset verrà inviato
tr: Sıfırlama bağlantısı gönderilecek

# supabaseSessionFailed
source: Could not create Supabase session. Some features may not work
ar: تعذّر إنشاء جلسة Supabase، لن تعمل بعض الميزات
de: Supabase Sitzung fehlgeschlagen
es: No se pudo crear sesión Supabase
fr: Impossible de créer la session Supabase
it: Impossibile creare sessione Supabase
tr: Supabase oturumu oluşturulamadı

# emailLabel
source: Email
ar: البريد الإلكتروني
es: Correo
tr: E-posta

# passwordLabel
source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
tr: Şifre

# registerTitle
source: Merchant Registration
ar: تسجيل تاجر
de: Händler Registrierung
es: Registro Comerciante
fr: Inscription Marchand
it: Registrazione Commerciante
tr: Tüccar Kaydı

# fillAllFields
source: Please fill all required fields
ar: يرجى تعبئة جميع الحقول المطلوبة
de: Bitte alle Felder ausfüllen
es: Complete todos los campos
fr: Veuillez remplir tous les champs requis
it: Compila tutti i campi richiesti
tr: Tüm alanları doldurun

# passwordsNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
de: Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
fr: Les mots de passe ne correspondent pas
it: Le password non coincidono
tr: Şifreler uyuşmuyor

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح
de: Ungültige E-Mail
es: Correo inválido
fr: Email non valide
it: Email non valida
tr: Geçersiz e-posta

# pickStoreLocation
source: Please select store location on map
ar: يرجى اختيار موقع المحل على الخريطة
de: Standort auswählen
es: Seleccione ubicación de la tienda
fr: Veuillez choisir l'emplacement du magasin
it: Seleziona posizione negozio
tr: Haritada mağaza konumu seçin

# emailAlreadyUsed
source: Email already registered, use login.
ar: هذا البريد مسجل مسبقاً، استخدم تسجيل الدخول.
de: E-Mail bereits registriert, bitte einloggen.
es: Correo ya registrado, use login.
fr: Email déjà utilisé, connectez-vous.
it: Email già registrata, fai login.
tr: E-posta zaten kayıtlı, giriş yapın.

# accountCreatedSuccess
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!
de: Konto erstellt!
es: Cuenta creada!
fr: Compte créé avec succès !
it: Account creato con successo!
tr: Hesap başarıyla oluşturuldu!

# accountCreateFailed
source: Account creation failed
ar: فشل إنشاء الحساب
de: Kontoerstellung fehlgeschlagen
es: Fallo al crear cuenta
fr: Échec de création du compte
it: Creazione account fallita
tr: Hesap oluşturma başarısız

# unexpectedError
source: Unexpected error occurred
ar: حدث خطأ غير متوقع
de: Unerwarteter Fehler
es: Error inesperado
fr: Erreur inattendue
it: Errore inatteso
tr: Beklenmeyen hata

# confirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور
de: Passwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma Password
tr: Şifreyi Onayla

# storeNameLabel
source: Store Name
ar: اسم المحل
de: Shop Name
es: Nombre tienda
fr: Nom du magasin
it: Nome Negozio
tr: Mağaza Adı

# phoneLabel
source: Phone
ar: رقم الهاتف
de: Telefon
es: Teléfono
fr: Téléphone
it: Telefono
tr: Telefon

# activityTypeLabel
source: Activity Type
ar: نوع النشاط
de: Aktivitätstyp
es: Tipo de actividad
fr: Type d'activité
it: Tipo Attività
tr: Faaliyet Türü

# otherActivityLabel
source: Other Activity
ar: نشاط آخر
de: Andere
es: Otro
fr: Autre activité
it: Altro
tr: Diğer

# locationLabel
source: Location
ar: الموقع
de: Standort
es: Ubicación
fr: Emplacement
it: Posizione
tr: Konum

# registerButton
source: Register
ar: إنشاء حساب
de: Registrieren
es: Registrar
fr: S'inscrire
it: Registrati
tr: Kayıt Ol

# selectLocationButton
source: Select Location
ar: اختيار الموقع
de: Standort wählen
es: Seleccionar ubicación
fr: Choisir emplacement
it: Seleziona posizione
tr: Konum seç

# getAutoLocationButton
source: Get auto location
ar: تحديد موقعي تلقائياً
de: Automatisch lokalisieren
es: Ubicar automáticamente
fr: Localiser auto
it: Localizza automaticamente
tr: Otomatik konum

# locatingMessage
source: Locating...
ar: جاري تحديد الموقع...
de: Lokalisieren...
es: Localizando...
fr: Localisation...
it: Localizzazione...
tr: Konum alınıyor...

# manageOffersTitle
source: Manage Offers
ar: إدارة العروض
de: Angebote verwalten
es: Gestionar ofertas
fr: Gérer Offres
it: Gestisci Offerte
tr: Teklifleri Yönet

source: Add New Offer
ar: إضافة عرض جديد
de: Neues Angebot
es: Nueva oferta
fr: Nouvelle offre
it: Nuova offerta
tr: Yeni teklif

# migrateOldOffers
source: Sync/Migrate old offers
ar: مزامنة/ترحيل العروض القديمة
de: Alte Angebote migrieren
es: Migrar ofertas antiguas
fr: Migrer anciennes offres
it: Migra offerte vecchie
tr: Eski teklifleri taşı

source: Offer ID missing!
ar: رقم العرض غير موجود!
de: Angebots-ID fehlt!
es: ID oferta faltante!
fr: ID offre manquant !
it: ID offerta mancante!
tr: Teklif kimliği yok!

# offerDeleted
source: Offer deleted successfully.
ar: تم حذف العرض بنجاح.
de: Angebot gelöscht.
es: Oferta eliminada.
fr: Offre supprimée.
it: Offerta eliminata.
tr: Teklif silindi.

# offerDeleteFailed
source: Failed to delete offer
ar: فشل حذف العرض
de: Löschen fehlgeschlagen
es: Fallo al eliminar
fr: Échec suppression offre
it: Eliminazione offerta fallita
tr: Silme başarısız

# offerStatusChanged
source: Offer status changed successfully.
ar: تم تغيير حالة العرض بنجاح.
de: Status geändert.
es: Estado de oferta cambiado.
fr: Statut offre modifié.
it: Stato offerta cambiato.
tr: Teklif durumu değişti.

# offerStatusChangeFailed
source: Failed to change offer status
ar: فشل تغيير حالة العرض
de: Statusänderung fehlgeschlagen
es: Fallo cambio estado
fr: Échec changement statut
it: Cambio stato fallito
tr: Durum değişimi başarısız

source: Auto migration failed
ar: فشل الترحيل التلقائي
de: Automatische Migration fehlgeschlagen
es: Migración automática falló
fr: Échec migration auto
it: Migrazione automatica fallita
tr: Otomatik taşıma başarısız

# offersMigratedCount
source: Migrated {count} offers from Firestore
ar: تم ترحيل {count} عرض من Firestore
de: {count} Angebote migriert
es: Migradas {count} ofertas de Firestore
fr: {count} offres migrées depuis Firestore
it: Migrati {count} offerte da Firestore
tr: Firestore'dan {count} teklif taşındı

# productsScreenTitle
source: Store Products
ar: منتجات المحل
de: Shop Produkte
es: Productos de la tienda
fr: Produits du magasin
it: Prodotti del negozio
tr: Mağaza Ürünleri

source: Import CSV
ar: استيراد CSV
de: CSV Import
es: Importar CSV
fr: Importer CSV
it: Importa CSV
tr: CSV İçe Aktar

# csvTemplate
source: Template
ar: نموذج
de: Vorlage
es: Plantilla
fr: Modèle
it: Modello
tr: Şablon

source: Export CSV
ar: تصدير CSV
de: CSV Export
es: Exportar CSV
fr: Exporter CSV
it: Esporta CSV
tr: CSV Dışa Aktar

source: Refresh
ar: تحديث
de: Aktualisieren
es: Refrescar
fr: Rafraîchir
it: Aggiorna
tr: Yenile

# searchHintProducts
source: Fast / fuzzy search product name...
ar: بحث سريع / غامض عن اسم المنتج...
de: Schnellsuche / fuzzy Produktname...
es: Búsqueda rápida / difusa nombre...
fr: Recherche floue nom produit...
it: Ricerca rapida / fuzzy nome...
tr: Hızlı / bulanık ürün adı...

# debugProductsBanner
source: [DEBUG] Products screen (dev only)
ar: [DEBUG] شاشة المنتجات (يظهر فقط في التطوير)
de: [DEBUG] Produktbildschirm
es: [DEBUG] Pantalla productos
fr: [DEBUG] Écran produits (dev)
it: [DEBUG] Schermata prodotti
tr: [DEBUG] Ürün ekranı

source: No products yet
ar: لا توجد منتجات بعد
de: Noch keine Produkte
es: Aún sin productos
fr: Aucun produit pour l'instant
it: Nessun prodotto ancora
tr: Henüz ürün yok

# addProductManual
source: Add product manually
ar: إضافة منتج يدوي
de: Produkt manuell hinzufügen
es: Agregar producto manual
fr: Ajouter produit manuellement
it: Aggiungi manuale
tr: Manuel ürün ekle

# addProduct
source: Add
ar: إضافة
de: Hinzufügen
es: Agregar
fr: Ajouter
it: Aggiungi
tr: Ekle

# addProductTitle
source: Add New Product
ar: إضافة منتج جديد
de: Neues Produkt
es: Agregar producto
fr: Ajouter un produit
it: Nuovo prodotto
tr: Yeni Ürün

# productNameLabel
source: Product Name
ar: اسم المنتج
de: Produktname
es: Nombre producto
fr: Nom du produit
it: Nome prodotto
tr: Ürün Adı

# productPointsLabel
source: Points for product
ar: النقاط للمنتج
de: Punkte für Produkt
es: Puntos del producto
fr: Points pour produit
it: Punti prodotto
tr: Ürün puanı

# basisSelectionLabel
source: Points based on:
ar: النقاط بناء على:
de: Punkte basierend auf:
es: Puntos basados en:
fr: Points basés sur:
it: Punti basati su:
tr: Puan temeli:

# basisProductDirect
source: Direct product
ar: المنتج مباشرة
de: Direktes Produkt
es: Producto directo
fr: Produit direct
it: Prodotto diretto
tr: Doğrudan ürün

# basisPrice
source: Price
ar: السعر
de: Preis
es: Precio
fr: Prix
it: Prezzo
tr: Fiyat

# basisQuantity
source: Quantity
ar: الكمية
de: Menge
es: Cantidad
fr: Quantité
it: Quantità
tr: Miktar

# basisOperation
source: Purchase operation
ar: عملية الشراء
de: Kaufvorgang
es: Operación compra
fr: Opération d'achat
it: Operazione acquisto
tr: Alım işlemi

source: Cancel
ar: إلغاء
de: Abbrechen
it: Annulla

# supabaseSessionMissing
source: Supabase session unavailable, login again
ar: جلسة Supabase غير متوفرة، أعد تسجيل الدخول
de: Supabase Sitzung fehlt
es: Sesion Supabase no disponible
fr: Session Supabase indisponible
it: Sessione Supabase assente
tr: Supabase oturumu yok

source: Product added
ar: تمت إضافة المنتج
de: Produkt hinzugefügt
es: Producto agregado
fr: Produit ajouté
it: Prodotto aggiunto
tr: Ürün eklendi

# productAddFailed
source: Add failed
ar: فشل الإضافة
de: Hinzufügen fehlgeschlagen
es: Fallo agregar
fr: Échec ajout
it: Aggiunta fallita
tr: Ekleme başarısız

# editProductTitle
source: Edit Product
ar: تعديل المنتج
de: Produkt bearbeiten
es: Editar producto
fr: Modifier produit
it: Modifica prodotto
tr: Ürünü Düzenle

source: Product name (immutable)
ar: اسم المنتج (غير قابل للتعديل)
de: Name (fix)
es: Nombre (fijo)
fr: Nom (non modifiable)
it: Nome (fisso)
tr: İsim (değişmez)

# productUpdated
source: Updated
ar: تم التحديث
de: Aktualisiert
es: Actualizado
fr: Mis à jour
it: Aggiornato
tr: Güncellendi

# productUpdateFailed
source: Update failed
ar: فشل التحديث
de: Aktualisierung fehlgeschlagen
es: Fallo actualización
fr: Échec mise à jour
it: Aggiornamento fallito
tr: Güncelleme başarısız

# emptyResults
source: No results
ar: لا نتائج
de: Keine Ergebnisse
es: Sin resultados
fr: Aucun résultat
it: Nessun risultato
tr: Sonuç yok

source: Clear
ar: مسح
de: Leeren
es: Limpiar
fr: Effacer
it: Pulisci
tr: Temizle

source: Search results: {count}
ar: نتائج البحث: {count}
de: Treffer: {count}
es: Resultados: {count}
fr: Résultats: {count}
it: Risultati: {count}
tr: Sonuç: {count}

# tableMissingTitle
source: Table missing
ar: الجدول غير موجود
de: Tabelle fehlt
es: Falta tabla
fr: Table manquante
it: Tabella mancante
tr: Tablo eksik

# tableMissingMessage
source: Create merchant_products table in Supabase then reopen page.
ar: أنشئ جدول merchant_products في Supabase ثم أعد فتح الصفحة.
de: Erstelle merchant_products Tabelle in Supabase und öffne erneut.
es: Cree tabla merchant_products en Supabase y reabra.
fr: Créez la table merchant_products dans Supabase puis rouvrez.
it: Crea tabella merchant_products in Supabase e riapri.
tr: Supabase'de merchant_products tablosu oluşturun ve yeniden açın.

source: Recheck
ar: إعادة الفحص
de: Prüfen
es: Revisar
fr: Revérifier
it: Ricontrolla
tr: Tekrar kontrol

# csvFileEmpty
source: Empty file
ar: ملف فارغ
de: Datei leer
es: Archivo vacío
fr: Fichier vide
it: File vuoto
tr: Dosya boş

source: Missing name
ar: اسم مفقود
de: Name fehlt
es: Nombre faltante
fr: Nom manquant
it: Nome mancante
tr: İsim eksik

source: Invalid points
ar: نقاط غير صالحة
de: Ungültige Punkte
es: Puntos inválidos
fr: Points invalides
it: Punti non validi
tr: Geçersiz puan

source: No processable rows
ar: لا صفوف قابلة للمعالجة
de: Keine verarbeitbaren Zeilen
es: Sin filas procesables
fr: Aucune ligne exploitable
it: Nessuna riga elaborabile
tr: İşlenecek satır yok

# parseFailed
source: Parsing failed
ar: فشل التحليل
de: Parsing fehlgeschlagen
es: Fallo parseo
fr: Échec analyse
it: Parsing fallito
tr: Ayrıştırma başarısız

# importReviewTitle
source: Import Review
ar: مراجعة الاستيراد
de: Importprüfung
es: Revisión import
fr: Revue import
it: Revisione import
tr: İçe aktarma inceleme

# validInvalidCount
source: Valid: {valid} | Errors: {invalid}
ar: صالحة: {valid} | أخطاء: {invalid}
de: Valide: {valid} | Fehler: {invalid}
es: Válidas: {valid} | Errores: {invalid}
fr: Valides: {valid} | Erreurs: {invalid}
it: Validi: {valid} | Errori: {invalid}
tr: Geçerli: {valid} | Hata: {invalid}

# skipDuplicateProducts
source: Skip duplicate product names
ar: تخطي المنتجات ذات الاسم المكرر
de: Doppelte Namen überspringen
es: Omitir nombres duplicados
fr: Ignorer doublons noms
it: Salta nomi duplicati
tr: Aynı isimlileri atla

# importingEllipsis
source: Importing...
ar: جارٍ الإدراج...
de: Importiere...
es: Importando...
fr: Importation...
it: Importazione...
tr: İçe aktarılıyor...

# importProductsButton
source: Import {count}
ar: استيراد {count}
de: Importiere {count}
es: Importar {count}
fr: Importer {count}
it: Importa {count}
tr: İçe aktar {count}

source: Session missing
ar: جلسة مفقودة
de: Session fehlt
es: Sesión faltante
fr: Session manquante
it: Sessione mancante
tr: Oturum yok

# noNewItemsAfterDuplicates
source: No new items after duplicates filter
ar: لا عناصر جديدة بعد تطبيق المكررات
de: Keine neuen Einträge nach Duplikaten
es: Sin nuevos tras duplicados
fr: Aucun nouvel élément après doublons
it: Nessun nuovo dopo duplicati
tr: Kopyalardan sonra yeni yok

# insertedProductsResult
source: Inserted {inserted} products (Rejected {rejected})
ar: تم إدراج {inserted} منتجاً (مرفوض {rejected})
de: Eingefügt {inserted} (Abgelehnt {rejected})
es: Insertados {inserted} (Rechazados {rejected})
fr: Inséré {inserted} (Rejeté {rejected})
it: Inseriti {inserted} (Respinti {rejected})
tr: Eklendi {inserted} (Reddedildi {rejected})

source: Import failed
ar: فشل الاستيراد
de: Import fehlgeschlagen
es: Importación falló
fr: Import échoué
it: Import fallito
tr: İçe aktarma başarısız

# csvExportCreated
source: CSV created - copy the text
ar: تم إنشاء CSV - انسخ النص
de: CSV erstellt - kopieren
es: CSV creado - copie
fr: CSV créé - copiez
it: CSV creato - copia
tr: CSV oluşturuldu - kopyala

source: Export failed
ar: فشل التصدير
de: Export fehlgeschlagen
es: Exportación falló
fr: Export échoué
it: Export fallito
tr: Dışa aktarma başarısız

# priceRuleFormat
source: Price {value} = {points} pts
ar: السعر {value} = {points} نقطة
de: Preis {value} = {points} Pkt
es: Precio {value} = {points} pts
fr: Prix {value} = {points} pts
it: Prezzo {value} = {points} pt
tr: Fiyat {value} = {points} puan

# quantityRuleFormat
source: Quantity {value} = {points} pts
ar: الكمية {value} = {points} نقطة
de: Menge {value} = {points} Pkt
es: Cantidad {value} = {points} pts
fr: Quantité {value} = {points} pts
it: Quantità {value} = {points} pt
tr: Miktar {value} = {points} puan

# operationRuleFormat
source: Operations {value} = {points} pts
ar: عدد العمليات {value} = {points} نقطة
de: Operationen {value} = {points} Pkt
es: Operaciones {value} = {points} pts
fr: Opérations {value} = {points} pts
it: Operazioni {value} = {points} pt
tr: İşlemler {value} = {points} puan

# pointsRuleFormat
source: Points: {points}
ar: النقاط: {points}
de: Punkte: {points}
es: Puntos: {points}
it: Punti: {points}
tr: Puan: {points}

# editPointsTooltip
source: Edit points
ar: تعديل النقاط
de: Punkte bearbeiten
es: Editar puntos
fr: Modifier points
it: Modifica punti
tr: Puan düzenle

# ruleValuePriceLabel
source: Target price
ar: السعر المحدد
de: Zielpreis
es: Precio objetivo
fr: Prix cible
it: Prezzo target
tr: Hedef fiyat

# ruleValueQuantityLabel
source: Target quantity
ar: الكمية المحددة
de: Zielmenge
es: Cantidad objetivo
fr: Quantité cible
it: Quantità target
tr: Hedef miktar

# ruleValueOperationLabel
source: Operations count
ar: عدد العمليات
de: Anzahl Vorgänge
es: Operaciones objetivo
fr: Nb opérations
it: N° operazioni
tr: İşlem sayısı

# rulePointsLabel
source: Points
ar: عدد النقاط
de: Punkte
es: Puntos
it: Punti
tr: Puan

# ruleExamplePrice
source: Example: 10 price = 1 pt
ar: مثال: 10 دينار = 1 نقطة
de: Bsp: 10 Preis = 1 Pkt
es: Ej: 10 precio = 1 pt
fr: Ex: 10 prix = 1 pt
it: Es: 10 prezzo = 1 pt
tr: Örn: 10 fiyat = 1 puan

# ruleExampleQuantity
source: Example: 5 pcs = 2 pts
ar: مثال: 5 قطع = 2 نقطة
de: Bsp: 5 Stk = 2 Pkt
es: Ej: 5 uds = 2 pts
fr: Ex: 5 pcs = 2 pts
it: Es: 5 pz = 2 pt
tr: Örn: 5 ad = 2 puan

# ruleExampleOperation
source: Example: 1 op = 3 pts
ar: مثال: 1 عملية = 3 نقاط
de: Bsp: 1 Vorg = 3 Pkt
es: Ej: 1 op = 3 pts
fr: Ex: 1 op = 3 pts
it: Es: 1 op = 3 pt
tr: Örn: 1 iş = 3 puan

# similarityFormat
source: Similarity: {sim}
ar: تشابه: {sim}
de: Ähnlichkeit: {sim}
es: Similitud: {sim}
fr: Similarité: {sim}
it: Somiglianza: {sim}
tr: Benzerlik: {sim}

source: No offers yet
ar: لا توجد عروض بعد
de: Noch keine Angebote
es: Sin ofertas aún
fr: Aucune offre pour l'instant
it: Ancora nessuna offerta
tr: Henüz teklif yok

source: No matching results
ar: لا نتائج مطابقة
de: Keine Treffer
es: Sin coincidencias
fr: Aucune correspondance
it: Nessuna corrispondenza
tr: Eşleşme yok

source: Not specified
ar: غير محدد
de: Nicht festgelegt
es: No especificado
fr: Non spécifié
it: Non specificato
tr: Belirtilmemiş

source: Store name unavailable
ar: اسم المحل غير متوفر
de: Shopname nicht verfügbar
es: Nombre tienda no disp.
fr: Nom magasin indisponible
it: Nome negozio non disp.
tr: Mağaza adı yok

source: No title
ar: بلا عنوان
de: Kein Titel
es: Sin título
fr: Sans titre
it: Senza titolo
tr: Başlıksız

source: No description
ar: لا يوجد وصف
de: Keine Beschreibung
es: Sin descripción
fr: Pas de description
it: Nessuna descrizione
tr: Açıklama yok

source: Delivery available
ar: خدمة التوصيل متوفرة
de: Lieferung verfügbar
es: Entrega disponible
fr: Livraison disponible
it: Consegna disponibile
tr: Teslimat var

source: Delivery not available
ar: خدمة التوصيل غير متوفرة
de: Lieferung nicht verfügbar
es: Entrega no disponible
fr: Livraison non disponible
it: Consegna non disponibile
tr: Teslimat yok

# endsAtPrefix
source: Ends at:
ar: ينتهي في:
de: Endet am:
es: Termina el:
fr: Se termine le:
it: Termina il:
tr: Bitiş:

# activeLabel
source: Active
ar: مفعل
de: Aktiv
es: Activo
fr: Actif
it: Attivo
tr: Aktif

# manageCustomersTitle
source: Manage Customers
ar: إدارة الزبائن
de: Kunden verwalten
es: Gestionar clientes
fr: Gérer Clients
it: Gestisci clienti
tr: Müşterileri Yönet

source: Loading customers...
ar: جاري تحميل الزبائن...
de: Kunden laden...
es: Cargando clientes...
fr: Chargement clients...
it: Caricamento clienti...
tr: Müşteriler yükleniyor...

# customersFetchError
source: Failed to load customers
ar: فشل جلب الزبائن
de: Kunden konnten nicht geladen werden
es: Error al cargar clientes
fr: Échec chargement clients
it: Errore caricamento clienti
tr: Müşteriler alınamadı

source: No customers yet
ar: لا يوجد زبائن بعد
de: Noch keine Kunden
es: Sin clientes aún
fr: Aucun client
it: Nessun cliente ancora
tr: Henüz müşteri yok

# pointsLabel
source: Points: {points}
ar: النقاط: {points}
de: Punkte: {points}
es: Puntos: {points}
it: Punti: {points}
tr: Puan: {points}

# customerDetailsTitle
source: Customer Details
ar: تفاصيل الزبون
de: Kundendetails
es: Detalles cliente
fr: Détails Client
it: Dettagli cliente
tr: Müşteri Detayları

source: Customer not found
ar: الزبون غير موجود
de: Kunde nicht gefunden
es: Cliente no encontrado
fr: Client introuvable
it: Cliente non trovato
tr: Müşteri bulunamadı

# totalPoints
source: Total points: {points}
ar: مجموع النقاط: {points}
de: Gesamtpunkte: {points}
es: Puntos totales: {points}
it: Punti totali: {points}
tr: Toplam puan: {points}

source: Purchase History
ar: تاريخه الشرائي
de: Kaufhistorie
es: Historial compras
fr: Historique achats
it: Storico acquisti
tr: Satın alma geçmişi

source: Redeemed Rewards
ar: الجوائز المستلمة
de: Eingelöste Prämien
es: Recompensas canjeadas
fr: Récompenses utilisées
it: Premi riscattati
tr: Kullanılan ödüller

source: Receipts History
ar: سجل الفواتير
de: Belegverlauf
es: Historial recibos
fr: Historique reçus
it: Storico ricevute
tr: Fiş geçmişi

source: Customer Offers
ar: عروض الزبون
de: Kundenangebote
es: Ofertas del cliente
fr: Offres du client
it: Offerte cliente
tr: Müşteri teklifleri

source: No purchases yet
ar: لا يوجد مشتريات بعد
de: Keine Käufe
es: Sin compras
fr: Aucun achat
it: Nessun acquisto
tr: Satın alma yok

# noRewardsYet
source: No redeemed rewards
ar: لا يوجد جوائز مستلمة
de: Keine Prämien
es: Sin recompensas
fr: Aucune récompense
it: Nessun premio
tr: Ödül yok

source: No receipts yet
ar: لا توجد فواتير بعد
de: Keine Belege
es: Sin recibos
fr: Aucun reçu
it: Nessuna ricevuta
tr: Fiş yok
